In [21]:
library(tidyverse)

In [22]:
transacoes_milhas <- read_csv("/content/transacoes_milhas.csv")

Rows: 1000 Columns: 4
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
dbl  (3): id_cliente, milhas_vendidas, valor_recebido
date (1): data_venda_milhas

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [23]:
transacoes_passagens <- read_csv("/content/transacoes_passagens.csv")

Rows: 1000 Columns: 6
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr  (1): classe_voo
dbl  (4): id_cliente, milhas_utilizadas, valor_pago, numero_voo
date (1): data_transacao

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [24]:
clientes <- read_csv("/content/clientes.csv")

Rows: 1000 Columns: 5
── Column specification ────────────────────────────────────────────────────────
Delimiter: ","
chr  (1): status_fidelidade
dbl  (3): id_cliente, milhas_acumuladas, gasto_total
date (1): data_nascimento

ℹ Use `spec()` to retrieve the full column specification for this data.
ℹ Specify the column types or set `show_col_types = FALSE` to quiet this message.

In [25]:
transacoes_milhas %>% head()

  id_cliente data_venda_milhas milhas_vendidas valor_recebido
1 350        2023-02-23        4131             536.88
2 109        2022-09-26        6525             113.70
3 376        2022-06-12        9955             466.73
4 443        2022-12-17        5913            1489.56
5 647        2023-10-06         284            1908.38
6 818        2023-05-29        4225            1339.10

In [26]:
transacoes_passagens %>% head()

  id_cliente data_transacao milhas_utilizadas valor_pago classe_voo
1 507        2023-01-30     9837               424.31    Economica
2  86        2023-03-07     6067               513.52    Economica
3 589        2022-02-11     2893              1320.34    Primeira Classe
4 774        2022-09-23     2274              1000.44    Economica
5 705        2023-06-08     6043              1607.35    Economica
6 316        2023-05-13     1798              1802.67    Executiva
  numero_voo
1 3705
2 9504
3 1695
4 2963
5 9190
6 6242

In [27]:
transacoes_milhas %>% glimpse()

Rows: 1,000
Columns: 4
$ id_cliente        <dbl> 350, 109, 376, 443, 647, 818, 32, 770, 707, 842, 170…
$ data_venda_milhas <date> 2023-02-23, 2022-09-26, 2022-06-12, 2022-12-17, 202…
$ milhas_vendidas   <dbl> 4131, 6525, 9955, 5913, 284, 4225, 2854, 6127, 5091,…
$ valor_recebido    <dbl> 536.88, 113.70, 466.73, 1489.56, 1908.38, 1339.10, 1…

In [28]:
clientes %>% glimpse()

Rows: 1,000
Columns: 5
$ id_cliente        <dbl> 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 1…
$ data_nascimento   <date> 1971-01-09, 1996-08-11, 1994-07-18, 2003-03-08, 196…
$ status_fidelidade <chr> "Diamante", "Diamante", "Diamante", "Prata", "Diaman…
$ milhas_acumuladas <dbl> 2833, 8864, 917, 8773, 1492, 6270, 2583, 8263, 8914,…
$ gasto_total       <dbl> 1906.69, 493.58, 519.16, 1256.60, 410.37, 250.93, 92…

In [29]:
transacoes_milhas %>% glimpse()

Rows: 1,000
Columns: 4
$ id_cliente        <dbl> 350, 109, 376, 443, 647, 818, 32, 770, 707, 842, 170…
$ data_venda_milhas <date> 2023-02-23, 2022-09-26, 2022-06-12, 2022-12-17, 202…
$ milhas_vendidas   <dbl> 4131, 6525, 9955, 5913, 284, 4225, 2854, 6127, 5091,…
$ valor_recebido    <dbl> 536.88, 113.70, 466.73, 1489.56, 1908.38, 1339.10, 1…

In [30]:
transacoes_passagens %>% glimpse()

Rows: 1,000
Columns: 6
$ id_cliente        <dbl> 507, 86, 589, 774, 705, 316, 801, 149, 11, 154, 363,…
$ data_transacao    <date> 2023-01-30, 2023-03-07, 2022-02-11, 2022-09-23, 202…
$ milhas_utilizadas <dbl> 9837, 6067, 2893, 2274, 6043, 1798, 4354, 6976, 6344…
$ valor_pago        <dbl> 424.31, 513.52, 1320.34, 1000.44, 1607.35, 1802.67, …
$ classe_voo        <chr> "Economica", "Economica", "Primeira Classe", "Econom…
$ numero_voo        <dbl> 3705, 9504, 1695, 2963, 9190, 6242, 2415, 6747, 3509…

In [31]:
transacoes_passagens <- transacoes_passagens %>% select(id_cliente, data_transacao, milhas_utilizadas, valor_pago)

In [32]:
transacoes_passagens %>% glimpse()

Rows: 1,000
Columns: 4
$ id_cliente        <dbl> 507, 86, 589, 774, 705, 316, 801, 149, 11, 154, 363,…
$ data_transacao    <date> 2023-01-30, 2023-03-07, 2022-02-11, 2022-09-23, 202…
$ milhas_utilizadas <dbl> 9837, 6067, 2893, 2274, 6043, 1798, 4354, 6976, 6344…
$ valor_pago        <dbl> 424.31, 513.52, 1320.34, 1000.44, 1607.35, 1802.67, …

In [33]:
transacoes_milhas <- transacoes_milhas %>% filter(data_venda_milhas >= "2022-01-01" & data_venda_milhas <= "2022-12-31")

In [34]:
transacoes_milhas %>% glimpse()

Rows: 485
Columns: 4
$ id_cliente        <dbl> 109, 376, 443, 32, 842, 609, 391, 600, 101, 761, 959…
$ data_venda_milhas <date> 2022-09-26, 2022-06-12, 2022-12-17, 2022-12-06, 202…
$ milhas_vendidas   <dbl> 6525, 9955, 5913, 2854, 5686, 937, 1190, 8295, 635, …
$ valor_recebido    <dbl> 113.70, 466.73, 1489.56, 1983.85, 191.69, 183.50, 47…

In [35]:
transacoes_passagens <- transacoes_passagens %>% filter(data_transacao >= "2022-01-01" & data_transacao <= "2022-12-31")

In [36]:
transacoes_passagens %>% glimpse()

Rows: 502
Columns: 4
$ id_cliente        <dbl> 589, 774, 149, 620, 96, 449, 693, 242, 358, 317, 633…
$ data_transacao    <date> 2022-02-11, 2022-09-23, 2022-11-07, 2022-08-12, 202…
$ milhas_utilizadas <dbl> 2893, 2274, 6976, 6479, 9444, 8102, 5335, 7139, 7280…
$ valor_pago        <dbl> 1320.34, 1000.44, 309.56, 1869.74, 267.63, 268.38, 1…

In [37]:
transacoes_passagens <- transacoes_passagens %>% mutate(custo_por_milha = valor_pago / milhas_utilizadas)

In [38]:
transacoes_passagens %>% glimpse()

Rows: 502
Columns: 5
$ id_cliente        <dbl> 589, 774, 149, 620, 96, 449, 693, 242, 358, 317, 633…
$ data_transacao    <date> 2022-02-11, 2022-09-23, 2022-11-07, 2022-08-12, 202…
$ milhas_utilizadas <dbl> 2893, 2274, 6976, 6479, 9444, 8102, 5335, 7139, 7280…
$ valor_pago        <dbl> 1320.34, 1000.44, 309.56, 1869.74, 267.63, 268.38, 1…
$ custo_por_milha   <dbl> 0.45639129, 0.43994723, 0.04437500, 0.28858466, 0.02…

In [39]:
media_milhas <- transacoes_passagens %>% group_by(id_cliente) %>% summarize(media_milhas = mean(milhas_utilizadas))

In [40]:
media_milhas %>% head()

  id_cliente media_milhas
1  3         1023.0
2  7         7074.5
3 10         6537.0
4 12         9312.0
5 13         4123.0
6 15         7541.0

In [41]:
transacoes_passagens %>% head()

  id_cliente data_transacao milhas_utilizadas valor_pago custo_por_milha
1 589        2022-02-11     2893              1320.34    0.45639129
2 774        2022-09-23     2274              1000.44    0.43994723
3 149        2022-11-07     6976               309.56    0.04437500
4 620        2022-08-12     6479              1869.74    0.28858466
5  96        2022-05-23     9444               267.63    0.02833863
6 449        2022-10-16     8102               268.38    0.03312515

In [42]:
transacoes_passagens <- transacoes_passagens %>% arrange(data_transacao)

In [43]:
transacoes_passagens %>% head()

  id_cliente data_transacao milhas_utilizadas valor_pago custo_por_milha
1 967        2022-01-01     1198              1217.17    1.0160017
2 747        2022-01-01     8451              1064.09    0.1259129
3 237        2022-01-01     7996              1684.94    0.2107229
4 504        2022-01-02     6143               692.94    0.1128016
5 840        2022-01-02     5267              1496.54    0.2841352
6 396        2022-01-02     1929               760.04    0.3940073

In [44]:
clientes %>% head()

  id_cliente data_nascimento status_fidelidade milhas_acumuladas gasto_total
1 1          1971-01-09      Diamante          2833              1906.69
2 2          1996-08-11      Diamante          8864               493.58
3 3          1994-07-18      Diamante           917               519.16
4 4          2003-03-08      Prata             8773              1256.60
5 5          1962-06-05      Diamante          1492               410.37
6 6          1988-02-08      Prata             6270               250.93

In [45]:
transacoes_passagens <- transacoes_passagens %>% left_join(clientes,by="id_cliente")

In [46]:
transacoes_passagens %>% head()

  id_cliente data_transacao milhas_utilizadas valor_pago custo_por_milha
1 967        2022-01-01     1198              1217.17    1.0160017
2 747        2022-01-01     8451              1064.09    0.1259129
3 237        2022-01-01     7996              1684.94    0.2107229
4 504        2022-01-02     6143               692.94    0.1128016
5 840        2022-01-02     5267              1496.54    0.2841352
6 396        2022-01-02     1929               760.04    0.3940073
  data_nascimento status_fidelidade milhas_acumuladas gasto_total
1 1963-12-21      Prata             7635               710.17
2 1967-04-16      Diamante          1952               706.99
3 1961-07-17      Ouro              5529              1002.03
4 1999-02-14      Diamante          8871               922.06
5 1983-12-04      Ouro              9589              1987.85
6 1972-06-30      Diamante          2142               285.24

In [48]:
transacoes_passagens <- transacoes_passagens %>% rename(
    Data_Compra_Passagem = data_transacao,
    Milhas_Utilizadas = milhas_utilizadas,
    Valor_Pago = valor_pago,
    Custo_Por_Milha = custo_por_milha,
    Data_Nascimento = data_nascimento,
    Status_Fidelidade = status_fidelidade,
    Milhas_Acumuladas = milhas_acumuladas,
    Gasto_Total = gasto_total
)

In [49]:
transacoes_passagens %>% head()

  id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago Custo_Por_Milha
1 967        2022-01-01           1198              1217.17    1.0160017
2 747        2022-01-01           8451              1064.09    0.1259129
3 237        2022-01-01           7996              1684.94    0.2107229
4 504        2022-01-02           6143               692.94    0.1128016
5 840        2022-01-02           5267              1496.54    0.2841352
6 396        2022-01-02           1929               760.04    0.3940073
  Data_Nascimento Status_Fidelidade Milhas_Acumuladas Gasto_Total
1 1963-12-21      Prata             7635               710.17
2 1967-04-16      Diamante          1952               706.99
3 1961-07-17      Ouro              5529              1002.03
4 1999-02-14      Diamante          8871               922.06
5 1983-12-04      Ouro              9589              1987.85
6 1972-06-30      Diamante          2142               285.24

In [51]:
transacoes_passagens %>% count(id_cliente) %>% rename(Total_Compras=n) %>% arrange(desc(Total_Compras)) %>% head()

  id_cliente Total_Compras
1 586        5
2 544        4
3 861        4
4 175        3
5 207        3
6 239        3

In [52]:
dados_milhas <- transacoes_passagens %>% select(id_cliente, Milhas_Utilizadas)

In [53]:
total_milhas_por_cliente <- dados_milhas %>% group_by(id_cliente) %>% summarise(total_milhas = sum(Milhas_Utilizadas))

In [55]:
total_milhas_por_cliente %>% arrange(desc(total_milhas)) %>% head()

  id_cliente total_milhas
1 544        28726
2 572        22209
3 890        19566
4  96        19047
5 945        18514
6  32        18126

In [56]:
transacoes_passagens <- transacoes_passagens %>% mutate(categoria_clinte = case_when(
  Milhas_Utilizadas < 2000 ~ "Baixo",
  Milhas_Utilizadas < 5000 ~ "Médio",
  TRUE ~ "Alto"
  ))

In [57]:
transacoes_passagens %>% head()

  id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago Custo_Por_Milha
1 967        2022-01-01           1198              1217.17    1.0160017
2 747        2022-01-01           8451              1064.09    0.1259129
3 237        2022-01-01           7996              1684.94    0.2107229
4 504        2022-01-02           6143               692.94    0.1128016
5 840        2022-01-02           5267              1496.54    0.2841352
6 396        2022-01-02           1929               760.04    0.3940073
  Data_Nascimento Status_Fidelidade Milhas_Acumuladas Gasto_Total
1 1963-12-21      Prata             7635               710.17
2 1967-04-16      Diamante          1952               706.99
3 1961-07-17      Ouro              5529              1002.03
4 1999-02-14      Diamante          8871               922.06
5 1983-12-04      Ouro              9589              1987.85
6 1972-06-30      Diamante          2142               285.24
  categoria_clinte
1 Baixo
2 Alto
3 Alto
4 Alto
5 Alto
6 Baixo

In [58]:
transacoes_passagens <- transacoes_passagens %>%
                        arrange(id_cliente, Data_Compra_Passagem) %>%
                        group_by(id_cliente) %>%
                        mutate(
                              diferenca_milhas = Milhas_Utilizadas - lag(Milhas_Utilizadas),
                              diferenca_valor_futuro = lead(Milhas_Utilizadas)
                        ) %>%
                          ungroup()

In [59]:
transacoes_passagens %>% head()

  id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago Custo_Por_Milha
1  3         2022-03-24           1023              1588.11    1.55240469
2  7         2022-09-16           9449              1906.01    0.20171553
3  7         2022-12-07           4700              1285.88    0.27359149
4 10         2022-06-07           6537               469.28    0.07178828
5 12         2022-10-29           9312               570.34    0.06124785
6 13         2022-09-07           4123               240.23    0.05826583
  Data_Nascimento Status_Fidelidade Milhas_Acumuladas Gasto_Total
1 1994-07-18      Diamante           917               519.16
2 1972-08-06      Diamante          2583               924.60
3 1972-08-06      Diamante          2583               924.60
4 1980-03-12      Bronze            3829               595.78
5 1978-10-09      Diamante          8857              1310.66
6 1996-12-31      Ouro              2228              1316.16
  categoria_clinte diferenca_milhas diferenca_valor_futuro
1 Baixo               NA              NA
2 Alto                NA            4700
3 Médio            -4749              NA
4 Alto                NA              NA
5 Alto                NA              NA
6 Médio               NA              NA

In [60]:
any(is.na(transacoes_passagens))

[1] TRUE

In [61]:
sum(is.na(transacoes_passagens))

[1] 788

In [62]:
num_clientes <- transacoes_passagens %>% summarise(num_clientes = n_distinct(id_cliente))

In [64]:
num_clientes * 2

  num_clientes
1 788

In [66]:
transacoes_passagens <- transacoes_passagens %>%
                        mutate(
                          diferenca_milhas = coalesce(diferenca_milhas, 0),
                          diferenca_valor_futuro = coalesce(diferenca_valor_futuro, 0)
                        )

In [67]:
any(is.na(transacoes_passagens))

[1] FALSE

In [68]:
transacoes_passagens %>% arrange(desc(diferenca_milhas)) %>% head(10)

   id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago Custo_Por_Milha
1  625        2022-12-30           7566              1890.54    0.24987312
2  961        2022-12-30           7215               594.29    0.08236868
3  151        2022-08-28           8923               689.02    0.07721842
4  820        2022-11-09           9658               472.85    0.04895941
5  807        2022-10-24           7239               361.49    0.04993646
6  370        2022-09-23           8858               884.50    0.09985324
7  586        2022-11-20           9478              1070.43    0.11293838
8  945        2022-12-19           7559              1441.52    0.19070247
9  332        2022-09-13           8010              1669.10    0.20837703
10 524        2022-05-01           7567              1649.38    0.21797013
   Data_Nascimento Status_Fidelidade Milhas_Acumuladas Gasto_Total
1  1971-12-03      Bronze            2787               897.42
2  2005-03-17      Ouro              1488              1011.49
3  1990-04-19      Ouro              6262              1087.80
4  1995-10-31      Diamante          3916              1843.98
5  1991-07-08      Diamante          9252              1515.46
6  1988-11-02      Bronze            5013              1905.95
7  1967-06-08      Ouro               463               980.86
8  1988-04-26      Prata             5547              1801.21
9  2002-04-14      Prata             4243               920.32
10 2000-08-16      Ouro              1139              1031.52
   categoria_clinte diferenca_milhas diferenca_valor_futuro
1  Alto             7122             0
2  Alto             7095             0
3  Alto             7009             0
4  Alto             6848             0
5  Alto             6740             0
6  Alto             6545             0
7  Alto             6222             0
8  Alto             6143             0
9  Alto             6112             0
10 Alto             6041             0

In [69]:
transacoes_passagens %>% arrange(desc(diferenca_valor_futuro)) %>% head(10)

   id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago Custo_Por_Milha
1  912        2022-05-11           4572               494.11    0.10807305
2  685        2022-06-19           4529              1612.55    0.35604990
3  371        2022-03-03           5410               143.81    0.02658226
4  820        2022-07-06           2810              1540.07    0.54806762
5  890        2022-02-01           9951               637.93    0.06410712
6  586        2022-09-06           3256               357.72    0.10986486
7   96        2022-03-14           9603              1917.23    0.19964907
8  548        2022-02-19           6482               687.07    0.10599661
9  144        2022-05-08           6847              1435.24    0.20961589
10 583        2022-01-29           5653               435.02    0.07695383
   Data_Nascimento Status_Fidelidade Milhas_Acumuladas Gasto_Total
1  1962-02-02      Diamante          1929              1788.99
2  1980-05-05      Bronze            4673              1553.53
3  1988-09-22      Prata             7580              1834.72
4  1995-10-31      Diamante          3916              1843.98
5  1974-03-14      Diamante           900              1615.20
6  1967-06-08      Ouro               463               980.86
7  1960-08-13      Prata             8772               406.40
8  1977-10-19      Ouro              2011               943.66
9  1981-08-02      Ouro              4620              1300.02
10 1971-01-03      Ouro              9373               619.76
   categoria_clinte diferenca_milhas diferenca_valor_futuro
1  Médio              0              9910
2  Médio              0              9755
3  Alto               0              9720
4  Médio              0              9658
5  Alto               0              9615
6  Médio            737              9478
7  Alto               0              9444
8  Alto               0              9317
9  Alto               0              9275
10 Alto               0              8997

In [71]:
transacoes_passagens <- transacoes_passagens %>%
                        mutate(categoria_clinte =
                          recode(categoria_clinte,
                            "Baixo" = "Iniciante",
                            "Médio" = "Intermediário",
                            "Alto" = "Avançado"
                          )
                        )

In [72]:
transacoes_passagens %>% head()

  id_cliente Data_Compra_Passagem Milhas_Utilizadas Valor_Pago Custo_Por_Milha
1  3         2022-03-24           1023              1588.11    1.55240469
2  7         2022-09-16           9449              1906.01    0.20171553
3  7         2022-12-07           4700              1285.88    0.27359149
4 10         2022-06-07           6537               469.28    0.07178828
5 12         2022-10-29           9312               570.34    0.06124785
6 13         2022-09-07           4123               240.23    0.05826583
  Data_Nascimento Status_Fidelidade Milhas_Acumuladas Gasto_Total
1 1994-07-18      Diamante           917               519.16
2 1972-08-06      Diamante          2583               924.60
3 1972-08-06      Diamante          2583               924.60
4 1980-03-12      Bronze            3829               595.78
5 1978-10-09      Diamante          8857              1310.66
6 1996-12-31      Ouro              2228              1316.16
  categoria_clinte diferenca_milhas diferenca_valor_futuro
1 Iniciante            0               0
2 Avançado             0            4700
3 Intermediário    -4749               0
4 Avançado             0               0
5 Avançado             0               0
6 Intermediário        0               0

In [74]:
transacoes_passagens %>% select (id_cliente, Milhas_Utilizadas, Milhas_Acumuladas) %>% head()

  id_cliente Milhas_Utilizadas Milhas_Acumuladas
1  3         1023               917
2  7         9449              2583
3  7         4700              2583
4 10         6537              3829
5 12         9312              8857
6 13         4123              2228

In [75]:
df_long <- transacoes_passagens %>%
            pivot_longer(
              cols = starts_with("Milhas"),
              names_to = "tipo_milhas",
              values_to = "quantidade"
            ) %>%
            select(id_cliente, tipo_milhas, quantidade)

In [76]:
df_long %>% head()

  id_cliente tipo_milhas       quantidade
1 3          Milhas_Utilizadas 1023
2 3          Milhas_Acumuladas  917
3 7          Milhas_Utilizadas 9449
4 7          Milhas_Acumuladas 2583
5 7          Milhas_Utilizadas 4700
6 7          Milhas_Acumuladas 2583

In [78]:
df_long %>%
  group_by(tipo_milhas) %>%
  summarise(
    media = mean(quantidade),
    mediana = median(quantidade),
    desvio_padrao = sd(quantidade),
  )

  tipo_milhas       media    mediana desvio_padrao
1 Milhas_Acumuladas 5028.865 4926.5  2916.979
2 Milhas_Utilizadas 5112.629 5260.5  2793.163